#include <stdio.h> // 표준 입출력 헤더 파일을 추가한다.

int main(void) // 메인 함수를 정의한다.
{
    double mid = 87.5, final = 92.0; // 중간고사, 기말고사 점수의 타입을 더블로 정의 후 값을 초기화한다.
    
    printf("중간고사 점수: "); // 중간고사 점수 입력 프롬프트를 출력한다.
    scanf("%lf", &mid); // 중간고사 점수를 더블 타입으로 입력 받는다.
    
    printf("기말고사 점수: "); // 기말고사 점수 입력 프롬프트를 출력한다
    scanf("%lf", &final); // 기말고사 점수를 더블 타입으로 입력 받는다.
    
    double avg; // 평균을 더블타입으로 정의한다.
    avg = (double) (mid + final) / 2; // 평균값을 캐스팅으로 더블타입으로 초기화한다.
    
    printf("평균: %.2f", avg); // 평균값을 소숫점 두자리까지 출력한다.

    return 0; // 함수를 종료한다.
}